[
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Spotify_icon.svg/320px-Spotify_icon.svg.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 1,
    "description": "Spotify is the premier destination for streaming millions of songs and podcasts from artists across the globe. You can easily create personalized playlists for any mood or occasion, follow your favorite artists to get updates on new releases, and discover music tailored precisely to your taste with our powerful recommendation engine. The platform offers seamless listening across all your devices—phone, tablet, desktop, and smart speakers. It's the essential app for music lovers looking to explore new genres, revisit classic tracks, and enjoy a vast, curated audio library anytime, anywhere. Beyond music, Spotify hosts a massive collection of exclusive and popular podcasts, making it your complete audio entertainment hub. Dive in and transform your listening experience.",
    "size": 85,
    "reviews": "12M",
    "ratingAvg": 4.8,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": "300K" },
      { "name": "2 star", "count": "200K" },
      { "name": "3 star", "count": "500K" },
      { "name": "4 star", "count": "2M" },
      { "name": "5 star", "count": "9.5M" }
    ]
  },
   {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/WhatsApp.svg/512px-WhatsApp.svg.png?20220228223904",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "id": 2,
    "description": "WhatsApp is the world's most popular messaging app, ensuring you stay effortlessly connected with friends and family across the globe. It offers secure, reliable, and free chat services for one-on-one and group conversations. The platform supports high-quality voice and video calls, allowing you to share moments face-to-face, no matter the distance. Security is paramount, with every message, call, and file protected by end-to-end encryption by default, ensuring only you and the person you're communicating with can read or hear what's sent. You can easily share photos, videos, documents, and voice notes. It's designed to work seamlessly on simple, low-bandwidth connections, making it a truly universal communication tool.",
    "size": 60,
    "reviews": "8M",
    "ratingAvg": 4.6,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "400K" },
      { "name": "2 star", "count": "300K" },
      { "name": "3 star", "count": "600K" },
      { "name": "4 star", "count": "2.2M" },
      { "name": "5 star", "count": "5.5M" }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Notion-logo.svg/320px-Notion-logo.svg.png",
    "title": "Notion",
    "companyName": "Notion Labs, Inc.",
    "id": 3,
    "description": "Notion functions as your ultimate all-in-one workspace, meticulously designed to boost your productivity and organization. It provides a flexible and modular system where you can write documents, plan projects, and collaborate with team members seamlessly. The app allows you to create versatile content, including simple notes, complex internal wikis, detailed task lists, and powerful, interconnected databases. Its clean and highly customizable layout lets you structure information precisely how you need it, adapting to your specific workflow whether you're a student, professional, or creative. Stop juggling multiple apps; Notion integrates everything into one powerful platform for a truly organized digital life.",
    "size": 90,
    "reviews": "2.4M",
    "ratingAvg": 4.7,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": "60K" },
      { "name": "2 star", "count": "40K" },
      { "name": "3 star", "count": "100K" },
      { "name": "4 star", "count": "400K" },
      { "name": "5 star", "count": "1.8M" }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/0/08/Pinterest-logo.png",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "id": 4,
    "description": "Pinterest is a visual discovery engine designed to help you discover and save creative ideas for virtually every facet of your life. It functions as a massive, user-curated catalog of inspiration, where you can browse and 'Pin' images and videos to your own customizable boards. Find the perfect recipes for dinner, get fresh ideas for home design and decor projects, stay updated on the latest fashion trends, or plan your dream travel itinerary. It's more than just a gallery; it's a powerful tool for visual brainstorming and project planning. Use it to collect and organize ideas, turning simple browsing into purposeful action. Your next great idea is waiting to be pinned.",
    "size": 72,
    "reviews": "3.5M",
    "ratingAvg": 4.5,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": "150K" },
      { "name": "2 star", "count": "90K" },
      { "name": "3 star", "count": "300K" },
      { "name": "4 star", "count": "800K" },
      { "name": "5 star", "count": "2.15M" }
    ]
  },
  {
    "image": "https://a.ltrbxd.com/logos/letterboxd-decal-dots-pos-rgb.svg",
    "title": "Letterboxd",
    "companyName": "Letterboxd Limited",
    "id": 5,
    "description": "Letterboxd is the essential social network for film lovers and cinephiles. It provides a dedicated space to log, organize, and track every film you've ever watched or plan to watch. You can share your cinematic experiences by writing detailed reviews, assigning ratings, and creating custom lists of your favorite or worst movies. The platform fosters a vibrant community where you can connect with others who share your movie tastes, discover new films through their activity, and engage in thoughtful discussions. It's a digital diary for your film journey, helping you analyze your viewing habits and find hidden gems recommended by fellow enthusiasts. Join the discussion and elevate your film appreciation.",
    "size": 50,
    "reviews": "1.2M",
    "ratingAvg": 4.9,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": "10K" },
      { "name": "2 star", "count": "7K" },
      { "name": "3 star", "count": "20K" },
      { "name": "4 star", "count": "150K" },
      { "name": "5 star", "count": "1.03M" }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/CKXcX7JO9sqdfNpDs_x-Js6Wd_cZ5LD_EZZu9q17sMp3UI6FG-rci7glK5V2m4fTayPi",
    "title": "Serialized",
    "companyName": "Serialized Studios",
    "id": 6,
    "description": "Serialized is the definitive app to help you meticulously keep track of your favorite TV shows, anime, and streaming series. Never again lose your place or wonder when the next season drops. The platform offers powerful tools to log what you've watched, manage your backlog, and receive personalized notifications. You can effortlessly discover what's trending across all major platforms, get countdowns for upcoming episodes, and mark episodes as watched with a single tap. It ensures you never miss a new episode or season premiere. Serialized keeps all your viewing progress organized in one centralized, easy-to-use interface, letting you focus on enjoying the shows you love.",
    "size": 45,
    "reviews": "650K",
    "ratingAvg": 4.6,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": "10K" },
      { "name": "2 star", "count": "9K" },
      { "name": "3 star", "count": "20K" },
      { "name": "4 star", "count": "90K" },
      { "name": "5 star", "count": "521K" }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/NWRVVF6zXvmcqspJwdFOKcQG6OlsNwpMOxED_DgB6B2BBDeWwAeWZKZxGhgqU0LQVJU",
    "title": "Forest",
    "companyName": "Seekrtech",
    "id": 7,
    "description": "Forest is a unique, gamified application designed to help you stay focused and effectively beat phone addiction. The core mechanism is simple yet powerful: when you need to concentrate, you plant a virtual tree in the app. This tree will grow only as long as you remain in the app and focused on your work. The moment you leave the app to check social media or other distractions, your tree dies, creating a powerful psychological incentive to stay productive. It helps you manage your time, cultivate healthy work habits, and promotes a sense of mindful productivity. Grow your digital forest into a testament to your concentration and commitment to deep work.",
    "size": 42,
    "reviews": "2M",
    "ratingAvg": 4.8,
    "downloads": "10M",
    "ratings": [
      { "name": "1 star", "count": "15K" },
      { "name": "2 star", "count": "8K" },
      { "name": "3 star", "count": "20K" },
      { "name": "4 star", "count": "200K" },
      { "name": "5 star", "count": "1.78M" }
    ]
  },
  {
    "image": "https://i.pinimg.com/736x/15/f9/75/15f975fce17e520de9166be72d0f253f.jpg",
    "title": "Evernote",
    "companyName": "Evernote Corporation",
    "id": 8,
    "description": "Evernote is a legendary tool in the productivity space, helping you to effortlessly capture ideas, big and small, in any format. It’s designed to be a complete solution for organizing your notes and effectively managing tasks across all of your devices. The power of Evernote lies in its versatile notes, which can contain text, photos, audio recordings, PDFs, web clippings, and more. With its robust search capabilities, you can find anything you've ever saved instantly. Whether you're planning a massive project, tracking meeting minutes, or simply jotting down a fleeting thought, Evernote brings everything together into one unified workspace that keeps your entire life organized and synchronized.",
    "size": 80,
    "reviews": "2.5M",
    "ratingAvg": 4.4,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": "80K" },
      { "name": "2 star", "count": "60K" },
      { "name": "3 star", "count": "200K" },
      { "name": "4 star", "count": "600K" },
      { "name": "5 star", "count": "1.55M" }
    ]
  },
  {
    "image": "https://appsimpleink.nyc3.cdn.digitaloceanspaces.com/logo/qEFglrSTcThOCDx5Nky1xBIm6pDn9TVSaz5EoUbw.jpg",
    "title": "Notion Boost",
    "companyName": "Notion Labs, Inc.",
    "id": 9,
    "description": "Notion Boost is the ultimate companion extension specifically designed to take your Notion productivity game to the next level. It significantly enhances the native Notion experience by adding a host of powerful features that streamline your workflow. You gain access to useful shortcuts, subtle yet impactful layout tweaks, and the ability to apply custom themes directly within your Notion workspace. Whether you're a dedicated student meticulously tracking notes or a professional expertly managing complex projects, this extension is invaluable. It helps you stay organized and efficient by blending its interface naturally with Notion's look, ensuring you get more done without distractions or a steep learning curve. Boost your daily efficiency today.",
    "size": 25,
    "reviews": "220K",
    "ratingAvg": 4.7,
    "downloads": "500K",
    "ratings": [
      { "name": "1 star", "count": "2K" },
      { "name": "2 star", "count": "1.5K" },
      { "name": "3 star", "count": "7K" },
      { "name": "4 star", "count": "30K" },
      { "name": "5 star", "count": "179.5K" }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Telegram_logo.svg/512px-Telegram_logo.svg.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 10,
    "description": "Telegram is a highly-regarded fast and secure messaging app that has become a powerful alternative to traditional chat services. Its architecture is built around speed and reliability, ensuring messages are delivered instantly across its massive network. Telegram is renowned for its powerful group chat features, allowing for communities of up to 200,000 members. Users can enjoy seamless and massive file sharing capabilities, handling all types of documents up to 2GB in size. A key focus is on privacy, offering features like secret chats with self-destructing messages and robust encryption protocols. It's a platform for both personal communication and managing large, active communities, providing a secure and feature-rich experience.",
    "size": 70,
    "reviews": "4M",
    "ratingAvg": 4.6,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "300K" },
      { "name": "2 star", "count": "200K" },
      { "name": "3 star", "count": "400K" },
      { "name": "4 star", "count": "1M" },
      { "name": "5 star", "count": "2.1M" }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Slack_icon_2019.svg/1024px-Slack_icon_2019.svg.png",
    "title": "Slack",
    "companyName": "Slack Technologies",
    "id": 11,
    "description": "Slack is the leading collaboration hub where teams come together to get work done efficiently and effectively. It replaces scattered email chains with a centralized, channel-based system for internal communication. Teams can message in real-time, organize conversations by project or topic, and easily share files with full search history. A major strength of Slack is its ability to integrate all your favorite tools, from Google Drive to Salesforce, directly into your workspace, minimizing the need to switch applications. It facilitates a transparent and asynchronous workflow, making it an essential tool for modern business communication, regardless of your team's size or location. Streamline your teamwork with Slack.",
    "size": 110,
    "reviews": "1.8M",
    "ratingAvg": 4.3,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": "60K" },
      { "name": "2 star", "count": "50K" },
      { "name": "3 star", "count": "200K" },
      { "name": "4 star", "count": "600K" },
      { "name": "5 star", "count": "890K" }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQJhyOBkI9m73a63Ayf9uQFQdDrLA5aTSJahQ&s",
    "title": "Duolingo",
    "companyName": "Duolingo, Inc.",
    "id": 12,
    "description": "Duolingo is the world's most popular language learning platform, making the process engaging and accessible for everyone. It helps you learn new languages like Spanish, French, German, and dozens more, through short, fun, bite-sized lessons. The platform uses a game-like structure, complete with points, levels, and leaderboards, to keep you motivated and committed to your progress. Duolingo's methodology is designed to make it remarkably easy to stay consistent with daily practice, which is the key to mastering a new tongue. By focusing on practical vocabulary and grammar within an addictive interface, it significantly helps users reach fluency goals faster and more enjoyably than traditional methods.",
    "size": 75,
    "reviews": "9M",
    "ratingAvg": 4.8,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": "150K" },
      { "name": "2 star", "count": "80K" },
      { "name": "3 star", "count": "200K" },
      { "name": "4 star", "count": "1M" },
      { "name": "5 star", "count": "7.62M" }
    ]
  },
  {
    "image": "https://img.icons8.com/color/200/todoist.png",
    "title": "Todoist",
    "companyName": "Doist Ltd.",
    "id": 13,
    "description": "Todoist is a world-class task manager designed to help you manage tasks and projects with ease and precision, regardless of their complexity. It provides an intuitive interface for quickly capturing and organizing all your to-dos, whether they are simple grocery lists or large-scale project milestones. The app's power lies in its ability to handle deadlines, recurring tasks, powerful reminders, and customizable priorities with smart scheduling. It integrates seamlessly with popular productivity apps and platforms, ensuring your task list is always at your fingertips. Todoist helps you move from feeling overwhelmed to having a clear, actionable plan, ensuring you can truly keep your life organized and focus on what matters most.",
    "size": 30,
    "reviews": "600K",
    "ratingAvg": 4.7,
    "downloads": "20M",
    "ratings": [
      { "name": "1 star", "count": "10K" },
      { "name": "2 star", "count": "7K" },
      { "name": "3 star", "count": "20K" },
      { "name": "4 star", "count": "90K" },
      { "name": "5 star", "count": "473K" }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRIV7OEwMgpKWzN-Td6lgrEcKzNQ8-vh-3pgA&s",
    "title": "Calm",
    "companyName": "Calm.com, Inc.",
    "id": 14,
    "description": "Calm is the world's leading app for meditation, sleep, and relaxation, dedicated to helping you achieve greater peace of mind and well-being. It offers a vast library of guided meditation sessions tailored for all levels, from beginners to experienced practitioners. A key feature is the extensive collection of Sleep Stories, calming bedtime tales narrated by soothing voices designed to help you drift off easily. Calm also includes peaceful background music, soundscapes, and breathing programs to promote mindfulness and reduce stress throughout your day. By incorporating these tools into your daily routine, Calm helps you sleep better and approach life with a calmer, more focused perspective.",
    "size": 65,
    "reviews": "3M",
    "ratingAvg": 4.7,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": "50K" },
      { "name": "2 star", "count": "30K" },
      { "name": "3 star", "count": "100K" },
      { "name": "4 star", "count": "700K" },
      { "name": "5 star", "count": "2.15M" }
    ]
  },
  {
    "image": "https://mma.prnewswire.com/media/1674635/NotabilityLogo.jpg",
    "title": "Notability",
    "companyName": "Ginger Labs",
    "id": 15,
    "description": "Notability is the powerful, award-winning note-taking app that seamlessly combines handwriting, photos, and typing into a single, cohesive note. Its innovative 'ink' technology provides a smooth, natural writing experience, making it feel like writing on real paper. The app allows you to record audio while you take notes, syncing the two so you can easily review what was being said as you wrote it. This feature makes it perfect for students recording lectures and professionals documenting meeting discussions. You can annotate PDFs, sketch diagrams, and organize all your notes with a flexible system, making it an indispensable tool for capturing, organizing, and reviewing critical information.",
    "size": 55,
    "reviews": "1.2M",
    "ratingAvg": 4.8,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": "8K" },
      { "name": "2 star", "count": "5K" },
      { "name": "3 star", "count": "12K" },
      { "name": "4 star", "count": "100K" },
      { "name": "5 star", "count": "1.09M" }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/2/24/Midjourney_Emblem.svg",
    "title": "Midjourney AI",
    "companyName": "Midjourney Labs",
    "id": 16,
    "description": "Midjourney AI is a groundbreaking creative platform that allows you to generate stunning visuals of professional quality using simple text prompts. Leveraging advanced artificial intelligence, this tool transforms your imagination into breathtaking works of digital art and photorealistic images. It’s a powerful engine for artists, designers, and hobbyists alike, making high-end graphic creation accessible to anyone. Midjourney effectively brings creativity and imagination together in one intuitive platform, giving you the power to explore infinite visual concepts. Whether you're prototyping a design, creating concept art, or just exploring the boundaries of AI-driven art, Midjourney provides an unparalleled experience in image generation.",
    "size": 95,
    "reviews": "890K",
    "ratingAvg": 4.9,
    "downloads": "7M",
    "ratings": [
      { "name": "1 star", "count": "9K" },
      { "name": "2 star", "count": "4K" },
      { "name": "3 star", "count": "20K" },
      { "name": "4 star", "count": "120K" },
      { "name": "5 star", "count": "737K" }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/065/386/871/non_2x/figma-logo-icon-figma-app-editable-transparent-background-premium-social-media-design-for-digital-download-free-png.png",
    "title": "Figma",
    "companyName": "Figma, Inc.",
    "id": 17,
    "description": "Figma is the industry-leading collaborative design tool that has revolutionized the way UI/UX designers and teams work together. Built to run entirely in your browser, it eliminates the need for complex installations and ensures everyone is always working on the latest version. Its robust feature set makes UI/UX design faster, smoother, and more fun, facilitating rapid prototyping, wireframing, and handoff. Multiple users can work on the same file simultaneously, providing true real-time collaboration. This powerful platform supports design systems, components, and developer handoff, making it the central hub for modern product design workflows and a key tool for global, distributed design teams.",
    "size": 150,
    "reviews": "950K",
    "ratingAvg": 4.8,
    "downloads": "20M",
    "ratings": [
      { "name": "1 star", "count": "8K" },
      { "name": "2 star", "count": "7K" },
      { "name": "3 star", "count": "20K" },
      { "name": "4 star", "count": "120K" },
      { "name": "5 star", "count": "795K" }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/032/329/171/non_2x/canva-icon-logo-symbol-free-png.png",
    "title": "Canva",
    "companyName": "Canva Pty Ltd",
    "id": 18,
    "description": "Canva is the world's most accessible graphic design tool, making powerful visual communication simple for everyone, regardless of their design experience. With an intuitive drag-and-drop interface and an immense library of templates, fonts, and stock imagery, you can create stunning visuals in minutes. It's the perfect platform to effortlessly create posters, engaging social media posts, professional presentations, business cards, and more. Canva empowers small businesses, marketers, students, and educators to produce high-quality designs quickly and efficiently. Break free from complex software and unlock your creative potential with a tool that truly puts design power in the hands of the many.",
    "size": 100,
    "reviews": "12M",
    "ratingAvg": 4.8,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": "200K" },
      { "name": "2 star", "count": "100K" },
      { "name": "3 star", "count": "300K" },
      { "name": "4 star", "count": "1M" },
      { "name": "5 star", "count": "10.5M" }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/054/298/846/non_2x/zoom-logo-illustration-in-square-background-free-png.png",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "id": 19,
    "description": "Zoom is the industry standard for video conferencing, designed to reliably bring teams together for effective communication and collaboration. The platform is renowned for its high-definition (HD video) quality, clear audio, and robust performance, even with a large number of participants. It offers comprehensive features for hosting engaging meetings, including screen sharing, virtual backgrounds, and meeting recordings. Beyond video, Zoom provides integrated chat and dedicated collaboration tools that are essential for modern distributed businesses and schools. It provides a stable, user-friendly, and scalable solution for connecting people globally, whether for a quick one-on-one or a large-scale webinar.",
    "size": 120,
    "reviews": "7M",
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "400K" },
      { "name": "2 star", "count": "300K" },
      { "name": "3 star", "count": "800K" },
      { "name": "4 star", "count": "2M" },
      { "name": "5 star", "count": "3.5M" }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Visual_Studio_Code_1.35_icon.svg/768px-Visual_Studio_Code_1.35_icon.svg.png",
    "title": "Visual Studio Code",
    "companyName": "Microsoft",
    "id": 20,
    "description": "Visual Studio Code (VS Code) is Microsoft's critically acclaimed, lightweight but powerful code editor that has become the de facto standard for developers worldwide. It’s an open-source, cross-platform application that runs everywhere—Windows, macOS, and Linux—offering a consistently fast and fluid coding environment. VS Code is packed with essential features like smart code completion (IntelliSense), debugging support, Git integration, and an enormous library of extensions. It is the perfect tool for a wide range of professionals, including web, app, and AI developers, enabling high-speed development and a highly personalized workflow. Elevate your coding productivity with its rich ecosystem of tools and extensions.",
    "size": 130,
    "reviews": "2.4M",
    "ratingAvg": 4.9,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": "10K" },
      { "name": "2 star", "count": "5K" },
      { "name": "3 star", "count": "20K" },
      { "name": "4 star", "count": "200K" },
      { "name": "5 star", "count": "2.18M" }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcREwYiqp3qosq9gLigZcIJ5FHEgoHG-B2DTrg&s",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "id": 21,
    "description": "Reddit is famously known as 'the front page of the internet,' serving as a sprawling network of communities and user-generated content. The platform is organized into thousands of specialized 'subreddits,' allowing you to dive into communities focused on every single topic imaginable, from niche hobbies to global news. It is a vibrant space for genuine discussions, sharing breaking news, hilarious memes, and in-depth analyses. Users submit posts, which are then upvoted or downvoted by the community, determining visibility and relevance. Reddit offers an unparalleled glimpse into diverse perspectives and is the go-to source for authentic, real-time conversation and content discovery across virtually all interests.",
    "size": 85,
    "reviews": "6M",
    "ratingAvg": 4.4,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": "400K" },
      { "name": "2 star", "count": "250K" },
      { "name": "3 star", "count": "500K" },
      { "name": "4 star", "count": "1.2M" },
      { "name": "5 star", "count": "3.65M" }
    ]
  },
  {
    "image": "https://img.freepik.com/premium-vector/twitter-new-x-logo-design-vector_1340851-70.jpg?semt=ais_hybrid&w=740&q=80",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "id": 22,
    "description": "X, formerly known as Twitter, is the world's real-time information network, designed to help you stay updated with the latest trends, breaking news, and viral conversations. The platform is built around short-form text posts, images, and videos, allowing information to disseminate globally at lightning speed. It effectively connects you to what's happening right now across politics, entertainment, sports, and countless other topics. X is where journalists, politicians, celebrities, and everyday users share their thoughts and engage in public discourse. It provides an immediate pulse on the world, serving as a powerful tool for discovering and participating in the global conversation as it unfolds.",
    "size": 90,
    "reviews": "11M",
    "ratingAvg": 4.3,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "800K" },
      { "name": "2 star", "count": "400K" },
      { "name": "3 star", "count": "1M" },
      { "name": "4 star", "count": "2.5M" },
      { "name": "5 star", "count": "6.3M" }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Instagram_icon.png/1200px-Instagram_icon.png",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 23,
    "description": "Instagram is the premier visual social media platform where you can effortlessly capture and share moments from your life with your friends and followers. Built primarily around high-quality photos and short videos, it’s a global stage for visual storytelling. You can explore a dynamic feed of content, dive into popular Reels for entertainment, and share your daily experiences through short-lived Stories. The platform is constantly evolving, allowing you to discover the latest trends in fashion, food, travel, and more from creators and users around the world. It’s the essential app for creative expression and connecting visually with a massive global audience.",
    "size": 95,
    "reviews": "20M",
    "ratingAvg": 4.6,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "700K" },
      { "name": "2 star", "count": "400K" },
      { "name": "3 star", "count": "900K" },
      { "name": "4 star", "count": "3M" },
      { "name": "5 star", "count": "15M" }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRmOQT83dtIlgCmJiM8X08gAFfHSDkuxBXA1Q&s",
    "title": "Threads",
    "companyName": "Meta Platforms, Inc.",
    "id": 24,
    "description": "Threads, developed by the team behind Instagram, is a dedicated text-based platform creating a new space to share ideas and join conversations in real time. It aims to be a fast, friendly, and open public conversation app, allowing users to engage in lively discussions and follow diverse voices. Designed for quick, text-centric updates, it provides an alternative to other microblogging platforms, emphasizing positive interaction. Since it is built by the Instagram team, it allows for seamless connectivity and an easy way to follow the creators and people you already know. Threads keeps the atmosphere lightweight and focuses on making the digital town square feel fast and friendly for everyone who joins.",
    "size": 60,
    "reviews": "800K",
    "ratingAvg": 4.2,
    "downloads": "50M",
    "ratings": [
      { "name": "1 star", "count": "70K" },
      { "name": "2 star", "count": "50K" },
      { "name": "3 star", "count": "90K" },
      { "name": "4 star", "count": "250K" },
      { "name": "5 star", "count": "340K" }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/016/716/450/non_2x/tiktok-icon-free-png.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 25,
    "description": "TikTok is the global phenomenon where creativity meets culture, reshaping the landscape of digital entertainment with its focus on short-form video. The platform empowers users to create short, engaging videos using an extensive suite of editing tools, filters, and a massive music library. Users can easily join global trends, participate in challenges, and use the 'For You' page to discover endless personalized content. It serves as a powerful medium for self-expression, allowing people to communicate ideas, humor, and storytelling through music and dance. TikTok's algorithmic feed ensures an immediate, highly-addictive, and continuously refreshing viewing experience that showcases diverse global talents and communities.",
    "size": 120,
    "reviews": "18M",
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "1M" },
      { "name": "2 star", "count": "500K" },
      { "name": "3 star", "count": "1.2M" },
      { "name": "4 star", "count": "3.5M" },
      { "name": "5 star", "count": "11.8M" }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/2965/2965311.png",
    "title": "Google Photos",
    "companyName": "Google LLC",
    "id": 26,
    "description": "Google Photos is the intelligent home for all your memories, designed to safely store and organize your photos and videos across all your devices. It offers unlimited or vast storage (depending on plan) with automatic backups, ensuring you never lose a precious moment. Its key feature is its revolutionary AI search capability, which allows you to find photos of specific people, places, or objects instantly without manual tagging. The app automatically creates stunning movies, collages, and animations from your media. With incredibly easy sharing options to friends and family, Google Photos simplifies media management, making it effortless to relive and share your life's captured moments.",
    "size": 80,
    "reviews": "10M",
    "ratingAvg": 4.7,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "300K" },
      { "name": "2 star", "count": "200K" },
      { "name": "3 star", "count": "400K" },
      { "name": "4 star", "count": "1.5M" },
      { "name": "5 star", "count": "8.2M" }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/2023_Obsidian_logo.svg/1024px-2023_Obsidian_logo.svg.png",
    "title": "Obsidian",
    "companyName": "Obsidian Labs",
    "id": 27,
    "description": "Obsidian is a powerful and highly customizable note-taking app built for true knowledge management, drawing inspiration from how the human brain connects ideas. It’s built on plain text Markdown files, giving you full control and ownership of your data, stored locally on your device. The core philosophy centers on helping you link your ideas together using internal links, gradually allowing you to create your personal knowledge graph. This graphical view of your thoughts reveals connections and patterns you didn't know existed, transforming simple note-taking into a powerful tool for deep thinking and creative synthesis. Obsidian is the ideal tool for researchers, writers, and anyone building a personal repository of interconnected information.",
    "size": 55,
    "reviews": "500K",
    "ratingAvg": 4.9,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": "4K" },
      { "name": "2 star", "count": "3K" },
      { "name": "3 star", "count": "10K" },
      { "name": "4 star", "count": "90K" },
      { "name": "5 star", "count": "396K" }
    ]
  },
  {
    "image": "https://www.svgrepo.com/show/354057/medium-icon.svg",
    "title": "Medium",
    "companyName": "A Medium Corporation",
    "id": 28,
    "description": "Medium is a leading platform for deep stories and influential ideas, providing a digital space for thoughtful long-form writing and authentic voices. Unlike fast-paced social feeds, Medium is designed to prioritize quality, in-depth content that sparks curiosity and learning. You can easily read, write, and connect with curious minds from all around the world, engaging directly with authors and other readers. The platform hosts a diverse range of topics, from technology and politics to personal development and creativity, ensuring there’s compelling content for every interest. It offers an ad-free reading environment, making it the perfect place to focus on significant content that truly matters and elevates your understanding.",
    "size": 70,
    "reviews": "1.2M",
    "ratingAvg": 4.6,
    "downloads": "10M",
    "ratings": [
      { "name": "1 star", "count": "20K" },
      { "name": "2 star", "count": "15K" },
      { "name": "3 star", "count": "50K" },
      { "name": "4 star", "count": "250K" },
      { "name": "5 star", "count": "920K" }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/1/1c/Pocket_logo.png",
    "title": "Pocket",
    "companyName": "Mozilla Corporation",
    "id": 29,
    "description": "Pocket is the essential application for saving content you discover online to view later, functioning as your personal digital read-it-later library. It allows you to quickly save articles and videos from any website, app, or platform with a single click. A key feature is its ability to transform clutter-filled web pages into a clean, distraction-free reading environment, stripping away ads and unnecessary sidebars. All your saved content is synchronized, allowing you to easily read across all your devices, whether you're online or offline. Pocket ensures that you never miss a compelling piece of content just because you didn't have time to read it immediately. Curate your knowledge effortlessly.",
    "size": 40,
    "reviews": "900K",
    "ratingAvg": 4.8,
    "downloads": "10M",
    "ratings": [
      { "name": "1 star", "count": "10K" },
      { "name": "2 star", "count": "6K" },
      { "name": "3 star", "count": "15K" },
      { "name": "4 star", "count": "120K" },
      { "name": "5 star", "count": "749K" }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSd4jbXkWaYRcqw7zkFheo1YSlmlUSaEZyQFw&s",
    "title": "Spotify Lite",
    "companyName": "Spotify AB",
    "id": 30,
    "description": "Spotify Lite is a specially optimized version of the main Spotify application, designed to be smaller, faster, and more efficient, especially for users with limited data or older devices. Weighing in as a significantly reduced package, it allows you to stream your favorite music and podcasts while being incredibly conservative with resource usage. This lite version includes essential features like searching, playing songs, and discovering new music, but is stripped down to ensure maximum performance. It's built to actively help you save data and storage space, offering control over how much mobile data you use. Enjoy the core Spotify experience without the heavy resource demands.",
    "size": 15,
    "reviews": "3.5M",
    "ratingAvg": 4.5,
    "downloads": "50M",
    "ratings": [
      { "name": "1 star", "count": "200K" },
      { "name": "2 star", "count": "150K" },
      { "name": "3 star", "count": "300K" },
      { "name": "4 star", "count": "800K" },
      { "name": "5 star", "count": "2.05M" }
    ]
  }
]